Catalogs/ВерсииПлатформенныхОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ВерсииПлатформенныхОбработок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПлатформенныеОбработки</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.ВерсииПлатформенныхОбработок</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеВерсии</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВерсииПлатформенныхОбработок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВерсииПлатформенныхОбработок") Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ДанныеЗаполнения;
	
	РеквизитыРодителя = "Владелец,Владелец.Наименование,ВерсияПриложения,Родитель,ДанныеВерсии,КлючевоеИмя";
	РеквизитыРодителя = УправлениеПлатформеннымиОбработками.ЗначенияРеквизитовОбъекта(Родитель, РеквизитыРодителя);
	Если ЗначениеЗаполнено(РеквизитыРодителя.Родитель) Тогда
		Родитель = РеквизитыРодителя.Родитель;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыРодителя, "ДанныеВерсии,Владелец,ВерсияПриложения,КлючевоеИмя");
	
	Наименование = СтрШаблон("%1 (исправленная версия %2)", РеквизитыРодителя.ВладелецНаименование, ВерсияПриложения);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
